InformationRegisters/ikon_cost_ДетализацияЗатратСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ikon_cost_ДетализацияЗатратСебестоимости</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗатрата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗатрата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗабалансовая</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Материальные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗабалансоваяУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗабалансоваяРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйУчет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВерсияРасчёта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчёта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРазузлование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРазузлованиеДопРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияПродукции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПартийПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияЗатрата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПартийЗатрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ikon_cost_КэшированиеРасчётов/Ext/Module.bsl
// Функции кэширования расчёта себестоимости
// Версия: 1.0.0.297
// Регистр: ikon_cost_ДетализацияЗатратСебестоимости

#Область КэшированиеРасчётов

// Версия алгоритма расчёта (для инвалидации кэша)
// При изменении алгоритма увеличить версию
Функция ВерсияАлгоритмаРасчёта() Экспорт
	Возврат "v1.0.0.313";
КонецФункции

// Проверяет наличие кэшированных данных за период
//
// Параметры:
//   ПериодРасчёта - Дата - первый день месяца
//   Версия - Строка - версия алгоритма
//
// Возвращаемое значение:
//   Булево - Истина если данные есть и версия совпадает
//
Функция ЕстьДанныеВКэше(ПериодРасчёта, Версия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК ЕстьДанные
	|ИЗ
	|	РегистрСведений.ikon_cost_ДетализацияЗатратСебестоимости КАК Данные
	|ГДЕ
	|	Данные.Период = &Период
	|	И Данные.ВерсияРасчёта = &Версия";

	Запрос.УстановитьПараметр("Период", ПериодРасчёта);
	Запрос.УстановитьПараметр("Версия", Версия);

	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();

КонецФункции

// Записывает результат расчёта в регистр сведений
//
// Параметры:
//   МенеджерВТ - МенеджерВременныхТаблиц - содержит таблицу "Результат"
//   ПериодРасчёта - Дата - первый день месяца
//   Версия - Строка - версия алгоритма
//   ДанныеПоСебестоимости - Число - вариант данных по себестоимости
//   ДатаОкончания - Дата - дата окончания периода
//
Процедура ЗаписатьРезультатВКэш(МенеджерВТ, ПериодРасчёта, Версия, ДанныеПоСебестоимости, ДатаОкончания) Экспорт

	// ============================================================================
	// ШАГ 0: Вычисляем КоличествоВыпуска для каждого продукта (уровень 0).
	// Используется позже для заполнения КоличествоВыпуска на всех уровнях.
	// ============================================================================
	Запрос0 = Новый Запрос;
	Запрос0.МенеджерВременныхТаблиц = МенеджерВТ;

	Запрос0.Текст =
	"ВЫБРАТЬ
	|	Результат.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции КАК ПартияПродукции,
	|	СУММА(Результат.Количество) КАК КоличествоВыпуска
	|ПОМЕСТИТЬ КоличествоВыпускаУровня0
	|ИЗ
	|	Результат КАК Результат
	|ГДЕ
	|	Результат.Уровень = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции";

	Запрос0.Выполнить();

	// ============================================================================
	// ФАЗА 1: Запись затрат (только уровни 1+) с реальными суммами.
	// ВСЕ строки уровня 0 исключены (Уровень > 0).
	// Строки с ТребуетсяРазузлование = Истина (полуфабрикаты-заголовки) исключены.
	// Строки с ТребуетсяРазузлованиеДопРасходов = Истина ВКЛЮЧЕНЫ (сохраняем суммы).
	// КоличествоВыпуска берётся из строки уровня 0 того же продукта (по ключу
	// АналитикаУчетаПродукции + ПартияПродукции).
	// ============================================================================
	Запрос1 = Новый Запрос;
	Запрос1.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос1.УстановитьПараметр("Период", ПериодРасчёта);
	Запрос1.УстановитьПараметр("Версия", Версия);
	Запрос1.УстановитьПараметр("ДатаРасчёта", ТекущаяДатаСеанса());

	Запрос1.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период КАК Период,
	|	&Версия КАК ВерсияРасчёта,
	|	&ДатаРасчёта КАК ДатаРасчёта,
	|	Результат.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции КАК ПартияПродукции,
	|	Результат.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
	|	Результат.Уровень КАК Уровень,
	|	Результат.Номенклатура КАК Номенклатура,
	|	Результат.ПартияЗатрата КАК ПартияЗатрата,
	|	Результат.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартийЗатрата,
	|	Результат.ТипЗатрат КАК ТипЗатрат,
	|	Результат.Подразделение КАК Подразделение,
	|	СУММА(Результат.Количество) КАК КоличествоЗатрата,
	|	МАКСИМУМ(КоличествоВыпускаУровня0.КоличествоВыпуска) КАК КоличествоВыпуска,
	|	СУММА(Результат.Сумма) КАК СуммаЗатрата,
	|	СУММА(Результат.СуммаЗабалансовая) КАК СуммаЗабалансовая,
	|	СУММА(Результат.Материальные) КАК Материальные,
	|	СУММА(Результат.Трудозатраты) КАК Трудозатраты,
	|	СУММА(Результат.ПостатейныеПостоянные) КАК ПостатейныеПостоянные,
	|	СУММА(Результат.ПостатейныеПеременные) КАК ПостатейныеПеременные,
	|	СУММА(Результат.ДопРасходы) КАК ДопРасходы,
	|	СУММА(Результат.НДД) КАК НДД,
	|	СУММА(Результат.МатериальныеСНДС) КАК МатериальныеСНДС,
	|	СУММА(Результат.ТрудозатратыСНДС) КАК ТрудозатратыСНДС,
	|	СУММА(Результат.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(Результат.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(Результат.ДопРасходыСНДС) КАК ДопРасходыСНДС,
	|	СУММА(Результат.МатериальныеБезНДС) КАК МатериальныеБезНДС,
	|	СУММА(Результат.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(Результат.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(Результат.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(Результат.МатериальныеУпр) КАК МатериальныеУпр,
	|	СУММА(Результат.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(Результат.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(Результат.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
	|	СУММА(Результат.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(Результат.СтоимостьЗабалансоваяУпр) КАК СтоимостьЗабалансоваяУпр,
	|	СУММА(Результат.МатериальныеРегл) КАК МатериальныеРегл,
	|	СУММА(Результат.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	СУММА(Результат.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	СУММА(Результат.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	СУММА(Результат.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(Результат.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Результат.НалоговыйУчет) КАК НалоговыйУчет,
	|	СУММА(Результат.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Результат.ВременнаяРазница) КАК ВременнаяРазница,
	|	МАКСИМУМ(Результат.ТребуетсяРазузлование) КАК ТребуетсяРазузлование,
	|	МАКСИМУМ(Результат.ТребуетсяРазузлованиеДопРасходов) КАК ТребуетсяРазузлованиеДопРасходов
	|ИЗ
	|	Результат КАК Результат
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоВыпускаУровня0 КАК КоличествоВыпускаУровня0
	|		ПО Результат.АналитикаУчетаПродукции = КоличествоВыпускаУровня0.АналитикаУчетаПродукции
	|			И Результат.ПартияПродукции = КоличествоВыпускаУровня0.ПартияПродукции
	|ГДЕ
	|	Результат.Уровень > 0
	|	И НЕ Результат.ТребуетсяРазузлование
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции,
	|	Результат.АналитикаУчетаПартийПродукции,
	|	Результат.Уровень,
	|	Результат.Номенклатура,
	|	Результат.ПартияЗатрата,
	|	Результат.АналитикаУчетаПартийЗатрата,
	|	Результат.ТипЗатрат,
	|	Результат.Подразделение
	|
	|ИТОГИ ПО
	|	АналитикаУчетаПродукции";

	РезультатЗапроса1 = Запрос1.Выполнить();
	Если РезультатЗапроса1.Пустой() Тогда
		Возврат;
	КонецЕсли;

	// ============================================================================
	// ФАЗА 2: Запись ВСЕХ строк уровня 0 (продукция).
	// КоличествоВыпуска = СУММА(Количество). Суммы затрат = 0.
	// Включает ВСЕ виды продукции: и полуфабрикаты, и не-полуфабрикаты.
	// ТребуетсяРазузлование в регистре = ЛОЖЬ (явно).
	// ============================================================================
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.УстановитьПараметр("Период", ПериодРасчёта);
	Запрос2.УстановитьПараметр("Версия", Версия);
	Запрос2.УстановитьПараметр("ДатаРасчёта", ТекущаяДатаСеанса());

	Запрос2.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период КАК Период,
	|	&Версия КАК ВерсияРасчёта,
	|	&ДатаРасчёта КАК ДатаРасчёта,
	|	Результат.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции КАК ПартияПродукции,
	|	Результат.АналитикаУчетаПартийПродукции КАК АналитикаУчетаПартийПродукции,
	|	Результат.Уровень КАК Уровень,
	|	Результат.Номенклатура КАК Номенклатура,
	|	Результат.ПартияЗатрата КАК ПартияЗатрата,
	|	Результат.АналитикаУчетаПартийЗатрата КАК АналитикаУчетаПартийЗатрата,
	|	Результат.ТипЗатрат КАК ТипЗатрат,
	|	Результат.Подразделение КАК Подразделение,
	|	0 КАК КоличествоЗатрата,
	|	СУММА(Результат.Количество) КАК КоличествоВыпуска,
	|	0 КАК СуммаЗатрата,
	|	0 КАК СуммаЗабалансовая,
	|	0 КАК Материальные,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянные,
	|	0 КАК ПостатейныеПеременные,
	|	0 КАК ДопРасходы,
	|	0 КАК НДД,
	|	0 КАК МатериальныеСНДС,
	|	0 КАК ТрудозатратыСНДС,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ДопРасходыСНДС,
	|	0 КАК МатериальныеБезНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК МатериальныеУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК СтоимостьЗабалансоваяУпр,
	|	0 КАК МатериальныеРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК НалоговыйУчет,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ЛОЖЬ КАК ТребуетсяРазузлование,
	|	ЛОЖЬ КАК ТребуетсяРазузлованиеДопРасходов
	|ИЗ
	|	Результат КАК Результат
	|ГДЕ
	|	Результат.Уровень = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.АналитикаУчетаПродукции,
	|	Результат.ПартияПродукции,
	|	Результат.АналитикаУчетаПартийПродукции,
	|	Результат.Уровень,
	|	Результат.Номенклатура,
	|	Результат.ПартияЗатрата,
	|	Результат.АналитикаУчетаПартийЗатрата,
	|	Результат.ТипЗатрат,
	|	Результат.Подразделение
	|
	|ИТОГИ ПО
	|	АналитикаУчетаПродукции";

	РезультатЗапроса2 = Запрос2.Выполнить();

	// ============================================================================
	// ЗАПИСЬ: объединяем результаты обоих запросов в один НаборЗаписей.
	// ============================================================================
	// Фаза 1: для каждой продукции создаём НаборЗаписей, очищаем, добавляем материалы.
	ВыборкаПродукций = РезультатЗапроса1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПродукций.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ikon_cost_ДетализацияЗатратСебестоимости.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ПериодРасчёта);
		НаборЗаписей.Отбор.АналитикаУчетаПродукции.Установить(ВыборкаПродукций.АналитикаУчетаПродукции);
		НаборЗаписей.Записать(); // Очищаем для данной продукции предыдущий кэш
		ВыборкаДетализации = ВыборкаПродукций.Выбрать();
		Пока ВыборкаДетализации.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетализации);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;

	// Фаза 2: для каждой продукции из запроса 2 ДОБАВЛЯЕМ записи уровня 0
	// к существующим записям (Уровень -- измерение, разные ключи не перезаписывают).
	Если НЕ РезультатЗапроса2.Пустой() Тогда
		ВыборкаПродукций2 = РезультатЗапроса2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПродукций2.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ikon_cost_ДетализацияЗатратСебестоимости.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодРасчёта);
			НаборЗаписей.Отбор.АналитикаУчетаПродукции.Установить(ВыборкаПродукций2.АналитикаУчетаПродукции);
			// ВАЖНО: НЕ вызываем Записать() перед добавлением -- это удалит записи Фазы 1!
			// Вместо этого читаем существующие записи и добавляем новые.
			НаборЗаписей.Прочитать();
			ВыборкаДетализации2 = ВыборкаПродукций2.Выбрать();
			Пока ВыборкаДетализации2.Следующий() Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетализации2);
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Получает данные из кэша и формирует внешние наборы для отчёта
//
// Параметры:
//   ПериодРасчёта - Дата - первый день месяца
//   НастройкиОтчета - НастройкиКомпоновкиДанных - настройки отчёта
//   ДанныеПоСебестоимости - Число - вариант данных
//   ВалютаУправленческогоУчета - СправочникСсылка.Валюты
//   ДатаОкончания - Дата
//
// Возвращаемое значение:
//   Структура - с ключами "Факт" и "Выпуски" (ТаблицаЗначений)
//
Функция ПолучитьДанныеИзКэша(ПериодРасчёта, НастройкиОтчета, ДанныеПоСебестоимости, ВалютаУправленческогоУчета, ДатаОкончания) Экспорт

	// Формируем отборы из настроек отчёта
	ОтборОрганизации = Неопределено;
	ОтборПродукции = Неопределено;
	ОтборПартии = Неопределено;
	ПоВсемОрганизациям = Истина;
	ПоВсейПродукции = Истина;
	ПоВсемПартиям = Истина;

	Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;

		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
			ОтборОрганизации = ЭлементОтбора.ПравоеЗначение;
			ПоВсемОрганизациям = Ложь;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Продукция") Тогда
			ОтборПродукции = ЭлементОтбора.ПравоеЗначение;
			ПоВсейПродукции = Ложь;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПартияПродукции") Тогда
			ОтборПартии = ЭлементОтбора.ПравоеЗначение;
			ПоВсемПартиям = Ложь;
		КонецЕсли;
	КонецЦикла;

	// Основной запрос к регистру
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ПериодРасчёта);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", ПоВсемОрганизациям);
	Запрос.УстановитьПараметр("Организации", ОтборОрганизации);
	Запрос.УстановитьПараметр("ПоВсейПродукции", ПоВсейПродукции);
	Запрос.УстановитьПараметр("Продукция", ОтборПродукции);
	Запрос.УстановитьПараметр("ПоВсемПартиям", ПоВсемПартиям);
	Запрос.УстановитьПараметр("ПартииПродукции", ОтборПартии);
	Запрос.УстановитьПараметр("ДанныеПоСебестоимости", ДанныеПоСебестоимости);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ВалютаУправленческогоУчета);

	// Таблица затрат (Факт)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлючиАналитики.Номенклатура КАК Продукция,
	|	КлючиАналитики.Характеристика КАК ХарактеристикаПродукции,
	|	КлючиАналитики.Назначение КАК НазначениеПродукции,
	|	Данные.ПартияПродукции КАК ПартияПродукции,
	|	КлючиАналитики.Номенклатура КАК Полуфабрикат,
	|	КлючиАналитики.Характеристика КАК ХарактеристикаПолуфабриката,
	|	Данные.Номенклатура КАК Затрата,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаЗатраты,
	|	Данные.СуммаЗатрата КАК Стоимость,
	|	Данные.Материальные КАК Материальные,
	|	Данные.ДопРасходы КАК ДопРасходы,
	|	Данные.Трудозатраты КАК Трудозатраты,
	|	Данные.ПостатейныеПостоянные КАК ПостатейныеПостоянные,
	|	Данные.ПостатейныеПеременные КАК ПостатейныеПеременные,
	|	Данные.СуммаЗабалансовая КАК Забалансовые,
	|	Данные.НалоговыйУчет КАК НалоговыйУчет,
	|	Данные.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Данные.ВременнаяРазница КАК ВременнаяРазница,
	|	Данные.НДД КАК НДД,
	|	Данные.КоличествоЗатрата КАК Количество,
	|	КлючиАналитики.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПродукции,
	|	Данные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПолуфабриката,
	|	Данные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЗатраты,
	|	Данные.ПартияПродукции.Организация КАК Организация,
	|	Данные.Подразделение КАК СтатьяКалькуляции,
	|	Данные.Подразделение КАК Подразделение,
	|	""Продукция"" КАК ТипДанных,
	|	НЕОПРЕДЕЛЕНО КАК Серия,
	|	Данные.ПартияЗатрата КАК ПартияЗатраты,
	|	Данные.Уровень КАК Уровень,
	|	ЕСТЬNULL(Данные.ТребуетсяРазузлование, ЛОЖЬ) КАК ТребуетсяРазузлование,
	|	ЕСТЬNULL(Данные.ТребуетсяРазузлованиеДопРасходов, ЛОЖЬ) КАК ТребуетсяРазузлованиеДопРасходов,
	|	&ВалютаУправленческогоУчета КАК Валюта
	|ИЗ
	|	РегистрСведений.ikon_cost_ДетализацияЗатратСебестоимости КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО Данные.АналитикаУчетаПродукции = КлючиАналитики.Ссылка
	|ГДЕ
	|	Данные.Период = &Период
	|	И (&ПоВсейПродукции
	|			ИЛИ КлючиАналитики.Номенклатура В (&Продукция))
	|	И (&ПоВсемПартиям
	|			ИЛИ Данные.ПартияПродукции В (&ПартииПродукции))";

	ТаблицаФакт = Запрос.Выполнить().Выгрузить();

	// Таблица выпусков (агрегация по продукции)
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлючиАналитики.Номенклатура КАК Продукция,
	|	КлючиАналитики.Характеристика КАК ХарактеристикаПродукции,
	|	КлючиАналитики.Назначение КАК НазначениеПродукции,
	|	Данные.ПартияПродукции КАК ПартияПродукции,
	|	КлючиАналитики.Номенклатура КАК Полуфабрикат,
	|	КлючиАналитики.Характеристика КАК ХарактеристикаПолуфабриката,
	|	СУММА(Данные.КоличествоВыпуска) КАК КоличествоВыпуск,
	|	Данные.ПартияПродукции.Организация КАК Организация,
	|	&ВалютаУправленческогоУчета КАК Валюта
	|ИЗ
	|	РегистрСведений.ikon_cost_ДетализацияЗатратСебестоимости КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО Данные.АналитикаУчетаПродукции = КлючиАналитики.Ссылка
	|ГДЕ
	|	Данные.Период = &Период
	|	И Данные.Уровень = 0
	|	И (&ПоВсейПродукции ИЛИ КлючиАналитики.Номенклатура В (&Продукция))
	|	И (&ПоВсемПартиям ИЛИ Данные.ПартияПродукции В (&ПартииПродукции))
	|
	|СГРУППИРОВАТЬ ПО
	|	КлючиАналитики.Номенклатура,
	|	КлючиАналитики.Характеристика,
	|	КлючиАналитики.Назначение,
	|	Данные.ПартияПродукции,
	|	Данные.ПартияПродукции.Организация,
	|	&ВалютаУправленческогоУчета";

	ТаблицаВыпуски = Запрос.Выполнить().Выгрузить();

	Результат = Новый Структура;
	Результат.Вставить("Факт", ТаблицаФакт);
	Результат.Вставить("Выпуски", ТаблицаВыпуски);

	Возврат Результат;

КонецФункции

// Удаляет кэшированные данные за период (для принудительного пересчёта)
//
// Параметры:
//   ПериодРасчёта - Дата - первый день месяца
//
Процедура ОчиститьКэшЗаПериод(ПериодРасчёта) Экспорт

	НаборЗаписей = РегистрыСведений.ikon_cost_ДетализацияЗатратСебестоимости.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодРасчёта);
	НаборЗаписей.Записать(Ложь); // Пустой набор = удаление (явно указываем удаление)

КонецПроцедуры

// Проверяет наличие кэшированных данных по конкретной продукции за период
//
// Параметры:
//   ПериодРасчёта - Дата - первый день месяца
//   Версия - Строка - версия алгоритма
//   СписокПродукции - Массив - список номенклатуры (если Неопределено или пустой - проверка всего периода)
//
// Возвращаемое значение:
//   Булево - Истина если данные есть для ВСЕХ указанных видов продукции
//
Функция ЕстьДанныеВКэшеПоПродукции(ПериодРасчёта, Версия, СписокПродукции = Неопределено) Экспорт

	// Если список не указан или пуст - проверяем наличие любых данных
	Если НЕ ЗначениеЗаполнено(СписокПродукции) Тогда
		Возврат ЕстьДанныеВКэше(ПериодРасчёта, Версия);
	КонецЕсли;

	// Проверяем, что для каждого вида продукции из списка есть хотя бы одна запись
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ключи.Номенклатура КАК Продукция
		|ИЗ
		|	РегистрСведений.ikon_cost_ДетализацияЗатратСебестоимости КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
		|		ПО Данные.АналитикаУчетаПродукции = Ключи.Ссылка
		|ГДЕ
		|	Данные.Период = &Период
		|	И Данные.ВерсияРасчёта = &Версия
		|	И Ключи.Номенклатура В (&СписокПродукции)";

	Запрос.УстановитьПараметр("Период", ПериодРасчёта);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("СписокПродукции", СписокПродукции);

	Результат = Запрос.Выполнить();
	
	Возврат (Не Результат.Пустой());

КонецФункции

// Удаляет кэшированные данные по конкретной продукции за период
//
// Параметры:
//   ПериодРасчёта - Дата - первый день месяца
//   СписокАналитики - Массив - список КлючиАналитикиУчетаНоменклатуры
//                               (если Неопределено или пустой - удалить всё за период)
//
Процедура ОчиститьКэшПоПродукции(ПериодРасчёта, СписокАналитики = Неопределено) Экспорт

	// Если список не указан или пуст - удаляем все записи за период
	Если НЕ ЗначениеЗаполнено(СписокАналитики) Тогда
		ОчиститьКэшЗаПериод(ПериодРасчёта);
		Возврат;
	КонецЕсли;

	// Создаём набор записей и записываем для очистки по продукции
	Для Каждого Аналитика Из СписокАналитики Цикл
		НаборЗаписей = РегистрыСведений.ikon_cost_ДетализацияЗатратСебестоимости.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ПериодРасчёта);
		НаборЗаписей.Отбор.АналитикаУчетаПродукции.Установить(Аналитика);
		НаборЗаписей.Записать(); // Замещение - удалит все записи за период и запишет только оставшиеся
	КонецЦикла;

КонецПроцедуры

// Получает список КлючиАналитикиУчетаНоменклатуры по списку номенклатуры за период
//
// Параметры:
//   ПериодРасчёта - Дата - период для поиска выпусков
//   ДатаОкончания - Дата - дата окончания периода
//   СписокНоменклатуры - Массив - список номенклатуры
//
// Возвращаемое значение:
//   Массив - список КлючиАналитикиУчетаНоменклатуры
//
Функция ПолучитьАналитикуПоНоменклатуре(ПериодРасчёта, ДатаОкончания, СписокНоменклатуры) Экспорт

	Если НЕ ЗначениеЗаполнено(СписокНоменклатуры) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукции.АналитикаУчетаНоменклатуры КАК Аналитика
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ВыпускПродукции.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|ГДЕ
	|	ВыпускПродукции.Период МЕЖДУ &ПериодРасчёта И &ДатаОкончания
	|	И КлючиАналитики.Номенклатура В(&СписокНоменклатуры)";

	Запрос.УстановитьПараметр("ПериодРасчёта", ПериодРасчёта);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);

	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Аналитика");

КонецФункции

#КонецОбласти
